Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.NoSpaceBoundingElementsWarn Property
 Can't create any energy analysis surfaces. There are no Space bounding elements defined in the current phase. Please check the Project Information settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSpaceBoundingElementsWarn { get; }
Public Shared ReadOnly Property NoSpaceBoundingElementsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSpaceBoundingElementsWarn {
	FailureDefinitionId^ get ();
}
static member NoSpaceBoundingElementsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace